app/controllers/application_controller.rb

    def set_current_user
        #home画面にアクセスしようとしたとき、ログイン済みか確認
        if session[:user_id]
            Current.user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]