app/controllers/main_controller.rb

    def index
        if session[:user_id]
	    # findの場合はユーザを存在しないとエラーを返すのでfind_byを使う
            @user = User.find_by(id: session[:user_id])
            @todos = Todo.where(user_id: @user.id) #user.user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]