app/controllers/signup_controller.rb

     def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("user_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["user_name", "test_user"], ["email", "tekitou@sample.jp"], ["password_digest", "[FILTERED]"], ["created_at", "2024-01-28 06:24:58.099662"], ["updated_at", "2024-01-28 06:24:58.099662"]]