app/controllers/todos_controller.rb

INSERT INTO "todos" ("text", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["text", "test"], ["created_at", "2024-01-28 01:11:47.158284"], ["updated_at", "2024-01-28 01:11:47.158284"]]
---
    def addTodo
      todo = Todo.new(todo_params)
      todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 1]]
---
    def deleteTodo
      todo = Todo.find(params[:id])
      todo.destroy